{
  "vocab": [
    "py",
    "self",
    "domain",
    "graph",
    "class",
    "run",
    "wws",
    "system",
    "devin",
    "db",
    "classes",
    "users",
    "bcl",
    "mysql",
    "config",
    "md",
    "vbstyle",
    "user",
    "check",
    "database",
    "fix",
    "methods",
    "engine",
    "rules",
    "search",
    "table",
    "full",
    "method",
    "line",
    "name",
    "know",
    "bytes",
    "build",
    "chat",
    "command",
    "domains",
    "import",
    "data",
    "real",
    "python",
    "mb",
    "don",
    "right",
    "read",
    "already",
    "missing",
    "print",
    "core",
    "lines",
    "add",
    "output",
    "text",
    "rule",
    "error",
    "see",
    "state",
    "step",
    "cli",
    "pipeline",
    "memunit",
    "node",
    "def",
    "folder",
    "first",
    "script",
    "gui",
    "main",
    "return",
    "ast",
    "ai",
    "cascade",
    "session",
    "layer",
    "none",
    "found",
    "test",
    "mac",
    "path",
    "time",
    "apple",
    "plan",
    "spec",
    "actually",
    "key",
    "server",
    "clean",
    "execution",
    "architecture",
    "done",
    "create",
    "json",
    "rustdesk",
    "question",
    "source",
    "everything",
    "result",
    "update",
    "calls",
    "write",
    "existing",
    "still",
    "com",
    "without",
    "model",
    "memory",
    "nodes",
    "running",
    "message",
    "list",
    "windows",
    "content",
    "understand",
    "messages",
    "terminal",
    "stop",
    "downloads",
    "next",
    "vector",
    "violations",
    "append",
    "instead",
    "sql",
    "dispatch",
    "header",
    "dom_vector",
    "analysis",
    "registry",
    "current",
    "different",
    "verify",
    "false",
    "init__",
    "correct",
    "imports",
    "structure",
    "work",
    "level",
    "doesn",
    "edges",
    "sqlite",
    "email",
    "pattern",
    "app",
    "something",
    "type",
    "actual",
    "built",
    "find",
    "shell",
    "rows",
    "exists",
    "inside",
    "status",
    "color",
    "truth",
    "context",
    "problem",
    "evidence",
    "results",
    "tables",
    "true",
    "agent",
    "tuple3",
    "schema",
    "start",
    "version",
    "mcp",
    "task",
    "tree",
    "fucking",
    "windsurf",
    "works",
    "commands",
    "complete",
    "info",
    "tool",
    "view",
    "uses",
    "params",
    "count",
    "vs",
    "conversation",
    "original",
    "sessions",
    "auto",
    "created",
    "null",
    "os",
    "authority",
    "call",
    "local",
    "try",
    "show",
    "tokens",
    "back",
    "set",
    "mode",
    "ran",
    "query",
    "good",
    "size",
    "macos",
    "parent",
    "window",
    "root",
    "added",
    "chatgpt",
    "questions",
    "across",
    "library",
    "based",
    "single",
    "services",
    "own",
    "process",
    "building",
    "directly",
    "exactly",
    "python3",
    "screen",
    "returns",
    "kb",
    "working",
    "goal",
    "issue",
    "report",
    "runtime",
    "client",
    "event",
    "storage",
    "detection",
    "paths",
    "class_name",
    "efl_brain",
    "extract",
    "look",
    "needs",
    "summary",
    "never",
    "open",
    "ram",
    "gap",
    "ssh",
    "raw",
    "seed",
    "words",
    "launchctl",
    "qdrant_mysql_mlx_vector_engine",
    "wants",
    "qdrant",
    "wrong",
    "bash",
    "knowledge",
    "runs",
    "duplicate",
    "extraction"
  ],
  "word_to_idx": {
    "py": 0,
    "self": 1,
    "domain": 2,
    "graph": 3,
    "class": 4,
    "run": 5,
    "wws": 6,
    "system": 7,
    "devin": 8,
    "db": 9,
    "classes": 10,
    "users": 11,
    "bcl": 12,
    "mysql": 13,
    "config": 14,
    "md": 15,
    "vbstyle": 16,
    "user": 17,
    "check": 18,
    "database": 19,
    "fix": 20,
    "methods": 21,
    "engine": 22,
    "rules": 23,
    "search": 24,
    "table": 25,
    "full": 26,
    "method": 27,
    "line": 28,
    "name": 29,
    "know": 30,
    "bytes": 31,
    "build": 32,
    "chat": 33,
    "command": 34,
    "domains": 35,
    "import": 36,
    "data": 37,
    "real": 38,
    "python": 39,
    "mb": 40,
    "don": 41,
    "right": 42,
    "read": 43,
    "already": 44,
    "missing": 45,
    "print": 46,
    "core": 47,
    "lines": 48,
    "add": 49,
    "output": 50,
    "text": 51,
    "rule": 52,
    "error": 53,
    "see": 54,
    "state": 55,
    "step": 56,
    "cli": 57,
    "pipeline": 58,
    "memunit": 59,
    "node": 60,
    "def": 61,
    "folder": 62,
    "first": 63,
    "script": 64,
    "gui": 65,
    "main": 66,
    "return": 67,
    "ast": 68,
    "ai": 69,
    "cascade": 70,
    "session": 71,
    "layer": 72,
    "none": 73,
    "found": 74,
    "test": 75,
    "mac": 76,
    "path": 77,
    "time": 78,
    "apple": 79,
    "plan": 80,
    "spec": 81,
    "actually": 82,
    "key": 83,
    "server": 84,
    "clean": 85,
    "execution": 86,
    "architecture": 87,
    "done": 88,
    "create": 89,
    "json": 90,
    "rustdesk": 91,
    "question": 92,
    "source": 93,
    "everything": 94,
    "result": 95,
    "update": 96,
    "calls": 97,
    "write": 98,
    "existing": 99,
    "still": 100,
    "com": 101,
    "without": 102,
    "model": 103,
    "memory": 104,
    "nodes": 105,
    "running": 106,
    "message": 107,
    "list": 108,
    "windows": 109,
    "content": 110,
    "understand": 111,
    "messages": 112,
    "terminal": 113,
    "stop": 114,
    "downloads": 115,
    "next": 116,
    "vector": 117,
    "violations": 118,
    "append": 119,
    "instead": 120,
    "sql": 121,
    "dispatch": 122,
    "header": 123,
    "dom_vector": 124,
    "analysis": 125,
    "registry": 126,
    "current": 127,
    "different": 128,
    "verify": 129,
    "false": 130,
    "init__": 131,
    "correct": 132,
    "imports": 133,
    "structure": 134,
    "work": 135,
    "level": 136,
    "doesn": 137,
    "edges": 138,
    "sqlite": 139,
    "email": 140,
    "pattern": 141,
    "app": 142,
    "something": 143,
    "type": 144,
    "actual": 145,
    "built": 146,
    "find": 147,
    "shell": 148,
    "rows": 149,
    "exists": 150,
    "inside": 151,
    "status": 152,
    "color": 153,
    "truth": 154,
    "context": 155,
    "problem": 156,
    "evidence": 157,
    "results": 158,
    "tables": 159,
    "true": 160,
    "agent": 161,
    "tuple3": 162,
    "schema": 163,
    "start": 164,
    "version": 165,
    "mcp": 166,
    "task": 167,
    "tree": 168,
    "fucking": 169,
    "windsurf": 170,
    "works": 171,
    "commands": 172,
    "complete": 173,
    "info": 174,
    "tool": 175,
    "view": 176,
    "uses": 177,
    "params": 178,
    "count": 179,
    "vs": 180,
    "conversation": 181,
    "original": 182,
    "sessions": 183,
    "auto": 184,
    "created": 185,
    "null": 186,
    "os": 187,
    "authority": 188,
    "call": 189,
    "local": 190,
    "try": 191,
    "show": 192,
    "tokens": 193,
    "back": 194,
    "set": 195,
    "mode": 196,
    "ran": 197,
    "query": 198,
    "good": 199,
    "size": 200,
    "macos": 201,
    "parent": 202,
    "window": 203,
    "root": 204,
    "added": 205,
    "chatgpt": 206,
    "questions": 207,
    "across": 208,
    "library": 209,
    "based": 210,
    "single": 211,
    "services": 212,
    "own": 213,
    "process": 214,
    "building": 215,
    "directly": 216,
    "exactly": 217,
    "python3": 218,
    "screen": 219,
    "returns": 220,
    "kb": 221,
    "working": 222,
    "goal": 223,
    "issue": 224,
    "report": 225,
    "runtime": 226,
    "client": 227,
    "event": 228,
    "storage": 229,
    "detection": 230,
    "paths": 231,
    "class_name": 232,
    "efl_brain": 233,
    "extract": 234,
    "look": 235,
    "needs": 236,
    "summary": 237,
    "never": 238,
    "open": 239,
    "ram": 240,
    "gap": 241,
    "ssh": 242,
    "raw": 243,
    "seed": 244,
    "words": 245,
    "launchctl": 246,
    "qdrant_mysql_mlx_vector_engine": 247,
    "wants": 248,
    "qdrant": 249,
    "wrong": 250,
    "bash": 251,
    "knowledge": 252,
    "runs": 253,
    "duplicate": 254,
    "extraction": 255
  },
  "vocab_size": 256,
  "embed_dim": 64,
  "hidden_dim": 128,
  "input_name": "text_bow",
  "output_name": "embedding"
}