{
  "vocab": [
    "file",
    "chats",
    "sessions",
    "files",
    "to",
    "search",
    "for",
    "about",
    "this",
    "which",
    "chat",
    "the",
    "show",
    "in",
    "loaded",
    "pb",
    "find",
    "all",
    "mysql",
    "session",
    "what",
    "list",
    "read",
    "export",
    "bcl",
    "tools",
    "database",
    "me",
    "of",
    "ram",
    "load",
    "pipeline",
    "that",
    "content",
    "db",
    "what's",
    "tokens",
    "directory",
    "voice",
    "discussed",
    "we",
    "talked",
    "cascade",
    "get",
    "detail",
    "touched",
    "model_gui.py",
    "who",
    "created",
    "mentioned",
    "edited",
    "keyword",
    "disk",
    "how",
    "many",
    "available",
    "count",
    "trajectories",
    "from",
    "markdown",
    "save",
    "verify",
    "check",
    "are",
    "old",
    "compress",
    "compression",
    "preview",
    "contents",
    "write",
    "kokoro",
    "mlx",
    "vbstyle",
    "conversations",
    "graph",
    "engine",
    "where",
    "qdrant",
    "cli",
    "look",
    "bloodhound",
    "migration",
    "embedding",
    "model",
    "error",
    "handling",
    "dom_bcl",
    "parser",
    "taskplanner",
    "config",
    "cascade_chats",
    "8fe75f98-5aff-47d7-9695-cc3acf2c6963",
    "details",
    "trajectory",
    "abc123",
    "full",
    "xyz",
    "tell",
    "12345",
    "happened",
    "8fe75f98",
    "info",
    "pb_reader.py",
    "config.py",
    "modified",
    "main.go",
    "tools.go",
    "bloodhound.c",
    "referenced",
    "model_gui",
    "messages",
    "everything",
    "decrypt",
    "into",
    "scan",
    "discover",
    "exist",
    "on",
    "stats",
    "statistics",
    "summary",
    "data",
    "overview",
    "is",
    "have",
    "conversation",
    "open",
    "abc.pb"
  ],
  "word_to_idx": {
    "file": 0,
    "chats": 1,
    "sessions": 2,
    "files": 3,
    "to": 4,
    "search": 5,
    "for": 6,
    "about": 7,
    "this": 8,
    "which": 9,
    "chat": 10,
    "the": 11,
    "show": 12,
    "in": 13,
    "loaded": 14,
    "pb": 15,
    "find": 16,
    "all": 17,
    "mysql": 18,
    "session": 19,
    "what": 20,
    "list": 21,
    "read": 22,
    "export": 23,
    "bcl": 24,
    "tools": 25,
    "database": 26,
    "me": 27,
    "of": 28,
    "ram": 29,
    "load": 30,
    "pipeline": 31,
    "that": 32,
    "content": 33,
    "db": 34,
    "what's": 35,
    "tokens": 36,
    "directory": 37,
    "voice": 38,
    "discussed": 39,
    "we": 40,
    "talked": 41,
    "cascade": 42,
    "get": 43,
    "detail": 44,
    "touched": 45,
    "model_gui.py": 46,
    "who": 47,
    "created": 48,
    "mentioned": 49,
    "edited": 50,
    "keyword": 51,
    "disk": 52,
    "how": 53,
    "many": 54,
    "available": 55,
    "count": 56,
    "trajectories": 57,
    "from": 58,
    "markdown": 59,
    "save": 60,
    "verify": 61,
    "check": 62,
    "are": 63,
    "old": 64,
    "compress": 65,
    "compression": 66,
    "preview": 67,
    "contents": 68,
    "write": 69,
    "kokoro": 70,
    "mlx": 71,
    "vbstyle": 72,
    "conversations": 73,
    "graph": 74,
    "engine": 75,
    "where": 76,
    "qdrant": 77,
    "cli": 78,
    "look": 79,
    "bloodhound": 80,
    "migration": 81,
    "embedding": 82,
    "model": 83,
    "error": 84,
    "handling": 85,
    "dom_bcl": 86,
    "parser": 87,
    "taskplanner": 88,
    "config": 89,
    "cascade_chats": 90,
    "8fe75f98-5aff-47d7-9695-cc3acf2c6963": 91,
    "details": 92,
    "trajectory": 93,
    "abc123": 94,
    "full": 95,
    "xyz": 96,
    "tell": 97,
    "12345": 98,
    "happened": 99,
    "8fe75f98": 100,
    "info": 101,
    "pb_reader.py": 102,
    "config.py": 103,
    "modified": 104,
    "main.go": 105,
    "tools.go": 106,
    "bloodhound.c": 107,
    "referenced": 108,
    "model_gui": 109,
    "messages": 110,
    "everything": 111,
    "decrypt": 112,
    "into": 113,
    "scan": 114,
    "discover": 115,
    "exist": 116,
    "on": 117,
    "stats": 118,
    "statistics": 119,
    "summary": 120,
    "data": 121,
    "overview": 122,
    "is": 123,
    "have": 124,
    "conversation": 125,
    "open": 126,
    "abc.pb": 127
  },
  "intents": [
    "cascade_chat_search_sessions",
    "cascade_chat_session_detail",
    "cascade_chat_search_files",
    "cascade_chat_search",
    "cascade_chat_load_all",
    "cascade_chat_scan",
    "cascade_chat_stats",
    "cascade_chat_list",
    "cascade_chat_read",
    "cascade_chat_export",
    "cascade_chat_export_db",
    "cascade_chat_verify_db",
    "cascade_chat_clean",
    "bcl_chat_compress",
    "bcl_chat_dry_run",
    "read_file",
    "write_file",
    "list_directory",
    "tools_md"
  ],
  "intent_keywords": {
    "cascade_chat_search_sessions": "search find session chat topic discussed conversation which where",
    "cascade_chat_session_detail": "detail full show session trajectory tell me about what happened",
    "cascade_chat_search_files": "file files mentioned touched created modified edited which what",
    "cascade_chat_search": "keyword search loaded ram messages content",
    "cascade_chat_load_all": "load all everything decrypt pb files",
    "cascade_chat_scan": "scan discover list files available how many exist",
    "cascade_chat_stats": "stats statistics count summary overview how many loaded",
    "cascade_chat_list": "list loaded what loaded show loaded trajectories",
    "cascade_chat_read": "read chat pb show conversation open file",
    "cascade_chat_export": "export markdown md archive save as markdown",
    "cascade_chat_export_db": "export mysql database populate sync transfer to db",
    "cascade_chat_verify_db": "verify check mysql all database missing from db",
    "cascade_chat_clean": "clean delete remove old chats pb files",
    "bcl_chat_compress": "compress bcl tokens tokenize extract tokens",
    "bcl_chat_dry_run": "dry run preview bcl estimate tokens preview compression",
    "read_file": "read file cat show contents what's in file",
    "write_file": "write save create file content to file",
    "list_directory": "list dir directory ls folder contents what's in directory",
    "tools_md": "tools help what tools available document tools generate docs"
  }
}